{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsDriverUpdateProfiles(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windowsDriverUpdateProfile",
    "@odata.id":  "deviceManagement/windowsDriverUpdateProfiles(\u002738698251-586e-4376-ba32-3bce3aae4f63\u0027)",
    "@odata.editLink":  "deviceManagement/windowsDriverUpdateProfiles(\u002738698251-586e-4376-ba32-3bce3aae4f63\u0027)",
    "id":  "38698251-586e-4376-ba32-3bce3aae4f63",
    "displayName":  "Win - WUfB Drivers - Ring 3 - Production",
    "description":  "",
    "approvalType@odata.type":  "#microsoft.graph.driverUpdateProfileApprovalType",
    "approvalType":  "automatic",
    "deviceReporting":  null,
    "newUpdates":  0,
    "deploymentDeferralInDays":  10,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2023-10-27T15:14:01.2386268Z",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2023-10-27T15:14:01.2386268Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "inventorySyncStatus":  null,
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsDriverUpdateProfiles(\u002738698251-586e-4376-ba32-3bce3aae4f63\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u002738698251-586e-4376-ba32-3bce3aae4f63\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u002738698251-586e-4376-ba32-3bce3aae4f63\u0027)/assignments",
    "assignments":  [

                    ],
    "driverInventories@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u002738698251-586e-4376-ba32-3bce3aae4f63\u0027)/driverInventories/$ref",
    "driverInventories@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u002738698251-586e-4376-ba32-3bce3aae4f63\u0027)/driverInventories",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u002738698251-586e-4376-ba32-3bce3aae4f63\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.executeAction":  {
                                           "title":  "microsoft.graph.executeAction",
                                           "target":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u002738698251-586e-4376-ba32-3bce3aae4f63\u0027)/microsoft.graph.executeAction"
                                       },
    "#microsoft.graph.syncInventory":  {
                                           "title":  "microsoft.graph.syncInventory",
                                           "target":  "https://graph.microsoft.com/beta/deviceManagement/windowsDriverUpdateProfiles(\u002738698251-586e-4376-ba32-3bce3aae4f63\u0027)/microsoft.graph.syncInventory"
                                       }
}
