{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(assignments(),settings())/$entity",
    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicy",
    "@odata.id":  "deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)",
    "@odata.editLink":  "deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-04-11T10:05:02.1138993Z",
    "creationSource":  null,
    "description":  "",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-12-05T20:15:44.1028249Z",
    "name":  "Win - SC - Windows Update for Business - D - Restart Warnings",
    "platforms@odata.type":  "#microsoft.graph.deviceManagementConfigurationPlatforms",
    "platforms":  "windows10",
    "priorityMetaData":  null,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "settingCount":  4,
    "technologies@odata.type":  "#microsoft.graph.deviceManagementConfigurationTechnologies",
    "technologies":  "mdm",
    "id":  "06f1e3a4-3a3d-4da3-92d2-33e7f102a587",
    "templateReference":  {
                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference",
                              "templateId":  "",
                              "templateFamily@odata.type":  "#microsoft.graph.deviceManagementConfigurationTemplateFamily",
                              "templateFamily":  "none",
                              "templateDisplayName":  null,
                              "templateDisplayVersion":  null
                          },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/assignments",
    "settings@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings",
    "settings@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings/$ref",
    "settings@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings",
    "settings":  [
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00270\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00270\u0027)",
                         "id":  "0",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_update_autorestartnotificationschedule_v2",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_update_autorestartnotificationschedule_15",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00270\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00270\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00271\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00271\u0027)",
                         "id":  "1",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_update_autorestartrequirednotificationdismissal",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_update_autorestartrequirednotificationdismissal_2",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00271\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00271\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00272\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00272\u0027)",
                         "id":  "2",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_update_scheduleimminentrestartwarning_v2",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_update_scheduleimminentrestartwarning_60",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00272\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00272\u0027)/settingDefinitions"
                     },
                     {
                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSetting",
                         "@odata.id":  "deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00273\u0027)",
                         "@odata.editLink":  "deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00273\u0027)",
                         "id":  "3",
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_update_schedulerestartwarning",
                                                 "settingInstanceTemplateReference":  null,
                                                 "choiceSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "device_vendor_msft_policy_config_update_schedulerestartwarning_8",
                                                                            "children@odata.type":  "#Collection(microsoft.graph.deviceManagementConfigurationSettingInstance)",
                                                                            "children":  [

                                                                                         ]
                                                                        }
                                             },
                         "settingDefinitions@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00273\u0027)/settingDefinitions/$ref",
                         "settingDefinitions@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/settings(\u00273\u0027)/settingDefinitions"
                     }
                 ],
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/microsoft.graph.assign"
                                },
    "#microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget":  {
                                                                       "title":  "microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget",
                                                                       "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/microsoft.graph.clearEnrollmentTimeDeviceMembershipTarget"
                                                                   },
    "#microsoft.graph.createCopy":  {
                                        "title":  "microsoft.graph.createCopy",
                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/microsoft.graph.createCopy"
                                    },
    "#microsoft.graph.reorder":  {
                                     "title":  "microsoft.graph.reorder",
                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/microsoft.graph.reorder"
                                 },
    "#microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget":  {
                                                                          "title":  "microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget",
                                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/microsoft.graph.retrieveEnrollmentTimeDeviceMembershipTarget"
                                                                      },
    "#microsoft.graph.setEnrollmentTimeDeviceMembershipTarget":  {
                                                                     "title":  "microsoft.graph.setEnrollmentTimeDeviceMembershipTarget",
                                                                     "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/microsoft.graph.setEnrollmentTimeDeviceMembershipTarget"
                                                                 },
    "#microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy":  {
                                                                        "title":  "microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy",
                                                                        "target":  "https://graph.microsoft.com/beta/deviceManagement/configurationPolicies(\u002706f1e3a4-3a3d-4da3-92d2-33e7f102a587\u0027)/microsoft.graph.retrieveLatestUpgradeDefaultBaselinePolicy"
                                                                    }
}
