{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.windowsHealthMonitoringConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration",
    "id":  "b5b1d29c-77ef-4b17-96f9-574179611a63",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-12-05T20:19:53.9919803Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-12-05T20:19:53.9919803Z",
    "description":  null,
    "displayName":  "Win - TP - Health Monitoring - D - Endpoint Analytics",
    "version":  1,
    "allowDeviceHealthMonitoring@odata.type":  "#microsoft.graph.enablement",
    "allowDeviceHealthMonitoring":  "enabled",
    "configDeviceHealthMonitoringScope@odata.type":  "#microsoft.graph.windowsHealthMonitoringScope",
    "configDeviceHealthMonitoringScope":  "bootPerformance",
    "configDeviceHealthMonitoringCustomScope":  null,
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/assignments",
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.windowsHealthMonitoringConfiguration/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027b5b1d29c-77ef-4b17-96f9-574179611a63\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
